=begin
eachの扱いについて
=end


#############################################
# 数値
#############################################
# num1
range = 1..5
range.each{|num|
  print("num1 = ", num)
  puts
}

# num2
(6..10).each{|num|
  print("num2 = ", num)
  puts
}

# num3
# 以下の例ではeachと同じことをforを使っている例
for num in 11..15 do
  print("num3 = ", num)
  puts
end

#############################################
# 文字列
#############################################
("a".."e").each do |str|
  print("str = " + str)
  puts
end

#############################################
# 配列
#############################################
ary = ["f", "g", "h"]
ary.each do |str|
  print("arystr = " + str)
  puts
end

#############################################
# ハッシュ
#############################################
hash = {
 10000 => 300,
 "太郎" => "次郎",
 true => false,
}

hash.each do |key, val|
  puts "#{key}、#{val}"
end

